Repository: 1compk/minios-skyline
Catalog: manpages/po/*/condinapt-minios.7.po
Languages: ru

source: October 2025
ru: Октябрь 2025

source: NAME
ru: ИМЯ

source: DESCRIPTION
ru: ОПИСАНИЕ

source: EXAMPLES
ru: ПРИМЕРЫ

source: SEE ALSO
ru: СМ. ТАКЖЕ

source: AUTHORS
ru: АВТОРЫ

source: MiniOS Development Team E<lt>https://minios.devE<gt>
ru: Команда разработчиков MiniOS E<lt>https://minios.devE<gt>

source: MiniOS Development Team.
ru: Команда разработчиков MiniOS.

source: \f[C] # Basic multimedia codecs - always gstreamer1.0-plugins-base gstreamer1.0-plugins-good\fR
ru: \f[C] # Базовые мультимедийные кодеки - всегда gstreamer1.0-plugins-base gstreamer1.0-plugins-good\fR

source: FILES
ru: ФАЙЛЫ

source: MiniOS CondinAPT Integration
ru: Интеграция CondinAPT с MiniOS

source: condinapt-minios - CondinAPT integration in the MiniOS build system
ru: condinapt-minios - Интеграция CondinAPT в систему сборки MiniOS

source: This document describes the specific aspects of using \f[B]condinapt\f[R](1) in the MiniOS build system.\fR
ru: В этом документе описываются специфические аспекты использования \f[B]condinapt\f[R](1) в системе сборки MiniOS.\fR

source: For basic CondinAPT features, see \f[B]condinapt\f[R](1).\fR
ru: Основные функции CondinAPT описаны в \f[B]condinapt\f[R](1).\fR

source: INTEGRATION WITH MINIOS BUILD SYSTEM
ru: ИНТЕГРАЦИЯ С СИСТЕМОЙ СБОРКИ MINIOS

source: Usage in MiniOS Modules
ru: Использование в модулях MiniOS

source: CondinAPT is a standard tool for package installation in MiniOS modules. It integrates into the build process through the standard module interface.
ru: CondinAPT является стандартным инструментом для установки пакетов в модулях MiniOS. Он интегрируется в процесс сборки через стандартный интерфейс модуля.

source: In the module installation script (\f[B]install\f[R]):\fR
ru: В скрипте установки модуля (\f[B]install\f[R]):\fR

source: \f[C]# Load MiniOS library \&. /minioslib || exit 1\fR
ru: \f[C]# Загрузка библиотеки MiniOS \&. /minioslib || exit 1\fR

source: \f[C]# Install packages via CondinAPT /usr/share/minios-live/condinapt \[rs] -l \[dq]$CWD/packages.list\[dq] \[rs] -c /etc/minios-live/build.conf \[rs] -m /usr/share/minios-live/condinapt.map\fR
ru: \f[C]# Установка пакетов через CondinAPT /usr/share/minios-live/condinapt \[rs] -l \[dq]$CWD/packages.list\[dq] \[rs] -c /etc/minios-live/build.conf \[rs] -m /usr/share/minios-live/condinapt.map\fR

source: MiniOS Module Structure
ru: Структура модуля MiniOS

source: Each module in \f[B]/usr/share/minios-live/scripts/\f[R] follows a standardized structure:\fR
ru: Каждый модуль в \f[B]/usr/share/minios-live/scripts/\f[R] имеет стандартизированную структуру:\fR

source: \f[C] XX-module-name/ \[u251C]\[u2500]\[u2500] packages.list # Package list with conditions \[u251C]\[u2500]\[u2500] install # Installation script (uses CondinAPT) \[u251C]\[u2500]\[u2500] rootcopy-install/ # (optional) Files to copy \[u2514]\[u2500]\[u2500] rootcopy-postinstall/ # (optional) Files after installation\fR
ru: \f[C] XX-module-name/ \[u251C]\[u2500]\[u2500] packages.list # Список пакетов с условиями \[u251C]\[u2500]\[u2500] install # Скрипт установки (использует CondinAPT) \[u251C]\[u2500]\[u2500] rootcopy-install/ # (опционально) Файлы для копирования \[u2514]\[u2500]\[u2500] rootcopy-postinstall/ # (опционально) Файлы после установки\fR

source: MINIOS CONFIGURATION
ru: КОНФИГУРАЦИЯ MINIOS

source: Filter Mapping
ru: Сопоставление фильтров

source: Contents of \f[B]condinapt.map\f[R] in MiniOS:\fR
ru: Содержимое \f[B]condinapt.map\f[R] в MiniOS:\fR

source: Configuration Variables
ru: Переменные конфигурации

source: Main variables from \f[B]build.conf\f[R]:\fR
ru: Основные переменные из \f[B]build.conf\f[R]:\fR

source: Target distribution (bookworm, trixie, jammy, noble)
ru: Целевой дистрибутив (bookworm, trixie, jammy, noble)

source: Architecture (amd64, i386, i386-pae)
ru: Архитектура (amd64, i386, i386-pae)

source: Desktop environment (core, flux, xfce, lxqt)
ru: Рабочее окружение (core, flux, xfce, lxqt)

source: Package variant (minimum, standard, toolbox, ultra)
ru: Вариант пакета (minimum, standard, toolbox, ultra)

source: Install kernel package (true/false)
ru: Установить пакет ядра (true/false)

source: Kernel flavour (none, rt, cloud)
ru: Вариант ядра (none, rt, cloud)

source: AUFS support (true/false)
ru: Поддержка AUFS (true/false)

source: Build DKMS modules (true/false)
ru: Собирать модули DKMS (true/false)

source: System locale (C, en_US, ru_RU, es_ES, pt_BR)
ru: Системная локаль (C, en_US, ru_RU, es_ES, pt_BR)

source: Multilingual support (true/false)
ru: Многоязычная поддержка (true/false)

source: Keep locales (true/false)
ru: Сохранять локали (true/false)

source: Automatically Calculated Variables
ru: Автоматически вычисляемые переменные

source: From \f[B]minioslib\f[R]:\fR
ru: Из \f[B]minioslib\f[R]:\fR

source: Distribution type (debian, ubuntu) - automatically determined based on DISTRIBUTION
ru: Тип дистрибутива (debian, ubuntu) - определяется автоматически на основе DISTRIBUTION

source: Multimedia Module
ru: Модуль мультимедиа

source: \f[C]# Additional codecs - not for minimal variant gstreamer1.0-plugins-bad -pv=minimum gstreamer1.0-plugins-ugly -pv=minimum gstreamer1.0-libav -pv=minimum\fR
ru: \f[C]# Дополнительные кодеки - не для минимального варианта gstreamer1.0-plugins-bad -pv=minimum gstreamer1.0-plugins-ugly -pv=minimum gstreamer1.0-libav -pv=minimum\fR

source: \f[C]# Professional tools - only for toolbox and ultra audacity +{pv=toolbox|pv=ultra} kdenlive +{pv=toolbox|pv=ultra} +{de=xfce|de=lxqt} --- # Distribution-specific packages from backports ffmpeg \[at]bookworm-backports +d=bookworm\fR
ru: \f[C]# Профессиональные инструменты - только для toolbox и ultra audacity +{pv=toolbox|pv=ultra} kdenlive +{pv=toolbox|pv=ultra} +{de=xfce|de=lxqt} --- # Пакеты для конкретного дистрибутива из backports ffmpeg \[at]bookworm-backports +d=bookworm\fR

source: Driver Module
ru: Модуль драйверов

source: \f[C] # Basic drivers mesa-utils xserver-xorg-video-all\fR
ru: \f[C] # Основные драйверы mesa-utils xserver-xorg-video-all\fR

source: \f[C]# NVIDIA drivers - only for non-free distributions nvidia-driver +d=bookworm -{pv=minimum&de=core}\fR
ru: \f[C]# Драйверы NVIDIA - только для несвободных дистрибутивов nvidia-driver +d=bookworm -{pv=minimum&de=core}\fR

source: \f[C]# AMD drivers - for modern distributions firmware-amd-graphics +{d=trixie|d=noble} mesa-vulkan-drivers +{d=trixie|d=noble}\fR
ru: \f[C]# Драйверы AMD - для современных дистрибутивов firmware-amd-graphics +{d=trixie|d=noble} mesa-vulkan-drivers +{d=trixie|d=noble}\fR

source: \f[C]# Old drivers - for old systems xserver-xorg-video-radeon +d=bookworm\fR
ru: \f[C]# Старые драйверы - для старых систем xserver-xorg-video-radeon +d=bookworm\fR

source: Localization Module
ru: Модуль локализации

source: \f[C] # Basic locales - always locales\fR
ru: \f[C] # Основные локали - всегда locales\fR

source: \f[C]# Russian localization language-pack-ru +lo=ru_RU fonts-liberation +lo=ru_RU firefox-esr-l10n-ru +lo=ru_RU +{de=xfce|de=lxqt}\fR
ru: \f[C]# Русская локализация language-pack-ru +lo=ru_RU fonts-liberation +lo=ru_RU firefox-esr-l10n-ru +lo=ru_RU +{de=xfce|de=lxqt}\fR

source: \f[C]# Multilingual support task-russian +ml=true +lo=ru_RU hunspell-ru +ml=true +lo=ru_RU\fR
ru: \f[C]# Многоязычная поддержка task-russian +ml=true +lo=ru_RU hunspell-ru +ml=true +lo=ru_RU\fR

source: \f[C]# Keeping locales vlc-l10n +kl=true +{pv=toolbox|pv=ultra}\fR
ru: \f[C]# Сохранение локалей vlc-l10n +kl=true +{pv=toolbox|pv=ultra}\fR

source: \f[C]# Regional settings for different locales language-pack-pt +lo=pt_BR language-pack-de +lo=de_DE language-pack-fr +lo=fr_FR\fR
ru: \f[C]# Региональные настройки для различных локалей language-pack-pt +lo=pt_BR language-pack-de +lo=de_DE language-pack-fr +lo=fr_FR\fR

source: Advanced Filter Usage
ru: Расширенное использование фильтров

source: \f[C] # DKMS modules with kernel and distribution conditions ntfs3-dkms -ka=true -d=buster -d=trixie -d=sid zfs-dkms +{pv=toolbox|pv=ultra} +da=amd64 +kbd=true -kf=none\fR
ru: \f[C] # Модули DKMS с условиями для ядра и дистрибутива ntfs3-dkms -ka=true -d=buster -d=trixie -d=sid zfs-dkms +{pv=toolbox|pv=ultra} +da=amd64 +kbd=true -kf=none\fR

source: \f[C]# Drivers for old systems broadcom-sta-dkms -d=jammy -ka=true -da=i386 aufs-dkms +dt=debian +d=buster\fR
ru: \f[C]# Драйверы для старых систем broadcom-sta-dkms -d=jammy -ka=true -da=i386 aufs-dkms +dt=debian +d=buster\fR

source: \f[C]# Exclusion for new distributions realtek-rtl8821cu-dkms -d=trixie -d=sid firmware-b43-installer -d=bionic\fR
ru: \f[C]# Исключение для новых дистрибутивов realtek-rtl8821cu-dkms -d=trixie -d=sid firmware-b43-installer -d=bionic\fR

source: \f[C]# Complex alternatives with filters exfatprogs -pv=minimum || exfat-utils -pv=minimum && exfat-fuse -pv=minimum\fR
ru: \f[C]# Сложные альтернативы с фильтрами exfatprogs -pv=minimum || exfat-utils -pv=minimum && exfat-fuse -pv=minimum\fR

source: \f[C]# Localization with exclusions and conditions vlc-l10n -lo=en_US +{pv=toolbox|pv=ultra} language-pack-gnome-ru-base +lo=ru_RU +dt=ubuntu language-pack-gnome-ru-base +ml=true +dt=ubuntu language-pack-gnome-ru-base +kl=true +dt=ubuntu\fR
ru: \f[C]# Локализация с исключениями и условиями vlc-l10n -lo=en_US +{pv=toolbox|pv=ultra} language-pack-gnome-ru-base +lo=ru_RU +dt=ubuntu language-pack-gnome-ru-base +ml=true +dt=ubuntu language-pack-gnome-ru-base +kl=true +dt=ubuntu\fR

source: Optimization for MiniOS
ru: Оптимизация для MiniOS

source: Grouping by functionality:
ru: Группировка по функциональности:

source: \f[C] #=== Core System === systemd +pv=standard +pv=toolbox +pv=ultra dbus\fR
ru: \f[C] #=== Базовая система === systemd +pv=standard +pv=toolbox +pv=ultra dbus\fR

source: \f[C]#=== Desktop Environment === xfce4-panel +de=xfce lxqt-panel +de=lxqt fluxbox +de=flux\fR
ru: \f[C]#=== Рабочее окружение === xfce4-panel +de=xfce lxqt-panel +de=lxqt fluxbox +de=flux\fR

source: \f[C]#=== Applications by Variant === firefox-esr +{pv=standard|pv=toolbox|pv=ultra} thunderbird +{pv=toolbox|pv=ultra} libreoffice +pv=ultra\fR
ru: \f[C]#=== Приложения по вариантам === firefox-esr +{pv=standard|pv=toolbox|pv=ultra} thunderbird +{pv=toolbox|pv=ultra} libreoffice +pv=ultra\fR

source: INTEGRATION WITH BUILD PROCESS
ru: ИНТЕГРАЦИЯ С ПРОЦЕССОМ СБОРКИ

source: Module Environment Variables
ru: Переменные окружения модуля

source: Within the MiniOS module context, the following variables are available:
ru: В контексте модуля MiniOS доступны следующие переменные:

source: Current module directory
ru: Текущая директория модуля

source: System name (usually \[lq]minios\[rq])
ru: Имя системы (обычно \[lq]minios\[rq])

source: Current module name
ru: Имя текущего модуля

source: Using minioslib
ru: Использование minioslib

source: Example installation script with conditional execution:
ru: Пример скрипта установки с условным выполнением:

source: \f[C]# Check module conditions if [ \[dq]$PACKAGE_VARIANT\[dq] = \[dq]minimum\[dq] ] && [ \[dq]$DESKTOP_ENVIRONMENT\[dq] = \[dq]core\[dq] ]; then echo \[dq]Skipping module for minimal core build\[dq] exit 0 fi\fR
ru: \f[C]# Проверка условий модуля if [ \[dq]$PACKAGE_VARIANT\[dq] = \[dq]minimum\[dq] ] && [ \[dq]$DESKTOP_ENVIRONMENT\[dq] = \[dq]core\[dq] ]; then echo \[dq]Пропуск модуля для минимальной сборки core\[dq] exit 0 fi\fR

source: \f[C]# Install packages /usr/share/minios-live/condinapt \[rs] -l \[dq]$CWD/packages.list\[dq] \[rs] -c /etc/minios-live/build.conf \[rs] -m /usr/share/minios-live/condinapt.map\fR
ru: \f[C]# Установка пакетов /usr/share/minios-live/condinapt \[rs] -l \[dq]$CWD/packages.list\[dq] \[rs] -c /etc/minios-live/build.conf \[rs] -m /usr/share/minios-live/condinapt.map\fR

source: Main MiniOS build configuration file
ru: Основной файл конфигурации сборки MiniOS

source: Filter mapping for MiniOS build system
ru: Сопоставление фильтров для системы сборки MiniOS

source: Package list for each module
ru: Список пакетов для каждого модуля

source: Module installation script
ru: Скрипт установки модуля
