Repository: 1compk/minios-skyline
Catalog: manpages/po/*/condinapt.1.po
Languages: ru

source: October 2025
ru: Октябрь 2025

source: NAME
ru: ИМЯ

source: SYNOPSIS
ru: КРАТКИЙ ОБЗОР

source: DESCRIPTION
ru: ОПИСАНИЕ

source: EXAMPLES
ru: ПРИМЕРЫ

source: SEE ALSO
ru: СМ. ТАКЖЕ

source: AUTHORS
ru: АВТОРЫ

source: MiniOS Development Team E<lt>https://minios.devE<gt>
ru: Команда разработчиков MiniOS E<lt>https://minios.devE<gt>

source: MiniOS Development Team.
ru: Команда разработчиков MiniOS.

source: OPTIONS
ru: ОПЦИИ

source: CondinAPT Package Manager
ru: Менеджер пакетов CondinAPT

source: condinapt - conditional package installation tool for Debian-like systems
ru: condinapt - инструмент условной установки пакетов для Debian-подобных систем

source: \f[B]condinapt\f[R] [\f[I]OPTIONS\f[R]]\fR
ru: \f[B]condinapt\f[R] [\f[I]ПАРАМЕТРЫ\f[R]]\fR

source: \f[B]CondinAPT\f[R] is a versatile tool for automating package installation in any Debian-like system (Debian, Ubuntu, and their derivatives). Its key feature is the ability to define complex conditions and rules for installing each package based on arbitrary system configurations.\fR
ru: \f[B]CondinAPT\f[R] — это универсальный инструмент для автоматизации установки пакетов в любой Debian-подобной системе (Debian, Ubuntu и их производных). Его ключевой особенностью является возможность определять сложные условия и правила для установки каждого пакета на основе произвольных конфигураций системы.\fR

source: Areas of Application
ru: Области применения

source: Linux distribution build systems
ru: Системы сборки дистрибутивов Linux

source: Automation of server and workstation setup
ru: Автоматизация настройки серверов и рабочих станций

source: Deployment of various system configurations
ru: Развёртывание различных системных конфигураций

source: Package management in Docker containers
ru: Управление пакетами в контейнерах Docker

source: CI/CD pipelines for environment setup
ru: CI/CD конвейеры для настройки окружения

source: Creation of custom installation images
ru: Создание пользовательских установочных образов

source: Key Features
ru: Ключевые особенности

source: \f[B]Conditional Installation:\f[R] Install packages based on flexible filters (+, -)\fR
ru: \f[B]Условная установка:\f[R] Установка пакетов на основе гибких фильтров (+, -)\fR

source: \f[B]External Configuration:\f[R] Complete separation of logic (package list) from data (system parameters)\fR
ru: \f[B]Внешняя конфигурация:\f[R] Полное разделение логики (список пакетов) от данных (параметры системы)\fR

source: \f[B]Installation Queues:\f[R] Divide the process into sequential stages to resolve dependencies\fR
ru: \f[B]Очереди установки:\f[R] Разделение процесса на последовательные этапы для разрешения зависимостей\fR

source: \f[B]Priority Queue:\f[R] Guaranteed installation of critical packages first\fR
ru: \f[B]Приоритетная очередь:\f[R] Гарантированная установка критически важных пакетов в первую очередь\fR

source: \f[B]Complex Logic:\f[R] Support for \[lq]AND\[rq] (&&), \[lq]OR\[rq] (||) operators, as well as group filters (+{a|b}, -{a&b})\fR
ru: \f[B]Сложная логика:\f[R] Поддержка операторов \[lq]И\[rq] (&&), \[lq]ИЛИ\[rq] (||), а также групповых фильтров (+{a|b}, -{a&b})\fR

source: \f[B]Readability:\f[R] Support for comments and empty lines to structure lists\fR
ru: \f[B]Читаемость:\f[R] Поддержка комментариев и пустых строк для структурирования списков\fR

source: \f[B]Backward Compatibility:\f[R] Supports simple package lists without conditions\fR
ru: \f[B]Обратная совместимость:\f[R] Поддержка простых списков пакетов без условий\fR

source: \f[B]-l\f[R], \f[B]--package-list\f[R] \f[I]PATH\fR
ru: \f[B]-l\f[R], \f[B]--package-list\f[R] \f[I]ПУТЬ\fR

source: (Required) Path to the package list file
ru: (Обязательно) Путь к файлу со списком пакетов

source: \f[B]-c\f[R], \f[B]--config\f[R] \f[I]PATH\fR
ru: \f[B]-c\f[R], \f[B]--config\f[R] \f[I]ПУТЬ\fR

source: (Required) Path to the main configuration file
ru: (Обязательно) Путь к основному файлу конфигурации

source: \f[B]-m\f[R], \f[B]--filter-mapping\f[R] \f[I]PATH\fR
ru: \f[B]-m\f[R], \f[B]--filter-mapping\f[R] \f[I]ПУТЬ\fR

source: (Optional) Path to the filter mapping file
ru: (Необязательно) Путь к файлу сопоставления фильтров

source: \f[B]-P\f[R], \f[B]--priority-list\f[R] \f[I]PATH\fR
ru: \f[B]-P\f[R], \f[B]--priority-list\f[R] \f[I]ПУТЬ\fR

source: (Optional) Path to the priority package list file
ru: (Необязательно) Путь к файлу списка приоритетных пакетов

source: Simulation mode. Packages will not be installed
ru: Режим симуляции. Пакеты не будут установлены

source: Only check if packages are already installed
ru: Только проверить, установлены ли пакеты

source: Verbose output
ru: Подробный вывод

source: Very verbose output
ru: Очень подробный вывод

source: Enable \f[B]set -x\f[R] command tracing\fR
ru: Включить трассировку команд \f[B]set -x\f[R]

source: Force apt cache update (apt update)
ru: Принудительно обновить кэш apt (apt update)

source: Show help
ru: Показать справку

source: CORE COMPONENTS
ru: ОСНОВНЫЕ КОМПОНЕНТЫ

source: CondinAPT operates with four key files:
ru: CondinAPT работает с четырьмя ключевыми файлами:

source: condinapt script
ru: Скрипт condinapt

source: The core, containing all processing logic
ru: Ядро, содержащее всю логику обработки

source: Main configuration file (-c)
ru: Основной файл конфигурации (-c)

source: A file with bash variables describing the current environment
ru: Файл с bash-переменными, описывающими текущее окружение

source: Example (\f[B]system.conf\f[R]):\fR
ru: Пример (\f[B]system.conf\f[R]):\fR

source: Filter mapping file (-m)
ru: Файл сопоставления фильтров (-m)

source: Links short prefixes (used in the package list) to variable names from the main configuration file. This file is \f[B]optional\f[R]. If a filter is not present in the filter mapping file, it will be used as a variable name from the main configuration file. If the variable is not found, CondinAPT will declare it empty.\fR
ru: Связывает короткие префиксы (используемые в списке пакетов) с именами переменных из основного файла конфигурации. Этот файл является \f[B]необязательным\f[R]. Если фильтр отсутствует в файле сопоставления фильтров, он будет использоваться как имя переменной из основного файла конфигурации. Если переменная не найдена, CondinAPT объявит её пустой.\fR

source: Example (\f[B]filters.map\f[R]):\fR
ru: Пример (\f[B]filters.map\f[R]):\fR

source: Package list file (-l)
ru: Файл со списком пакетов (-l)

source: The main file describing what to install and under what conditions
ru: Основной файл, описывающий что и при каких условиях устанавливать

source: PACKAGE LIST SYNTAX
ru: СИНТАКСИС СПИСКА ПАКЕТОВ

source: Each line in the package list file consists of two main parts:
ru: Каждая строка в файле списка пакетов состоит из двух основных частей:

source: Package name with optional version and release specification
ru: Имя пакета с опциональным указанием версии и релиза

source: Condition filters - define the conditions under which the package will be installed
ru: Фильтры условий - определяют условия, при которых пакет будет установлен

source: Package Name Structure
ru: Структура имени пакета

source: \f[B]Simple name:\fR
ru: \f[B]Простое имя:\fR

source: \f[B]Package version:\fR
ru: \f[B]Версия пакета:\fR

source: \f[B]package=version\f[R] - loose version requirement. If the required version is unavailable, an available version is installed\fR
ru: \f[B]package=version\f[R] - нестрогое требование к версии. Если требуемая версия недоступна, устанавливается любая доступная версия\fR

source: \f[B]package==version\f[R] - strict requirement. If the version is not found, installation aborts with an error\fR
ru: \f[B]package==version\f[R] - строгое требование. Если версия не найдена, установка прерывается с ошибкой\fR

source: \f[B]Release specification:\fR
ru: \f[B]Указание релиза:\fR

source: The release is specified using the **\[at]** symbol:
ru: Релиз указывается с помощью символа **\[at]**:

source: File Structure
ru: Структура файла

source: \f[B]Package names:\f[R] Each package or condition is written on a new line\fR
ru: \f[B]Имена пакетов:\f[R] Каждый пакет или условие записывается на новой строке\fR

source: \f[B]Comments:\f[R] Lines starting with \f[B]#\f[R], or text after \f[B]#\f[R] on a line, are completely ignored\fR
ru: \f[B]Комментарии:\f[R] Строки, начинающиеся с \f[B]#\f[R], или текст после \f[B]#\f[R] в строке полностью игнорируются\fR

source: \f[B]Empty lines:\f[R] Ignored and serve for visual separation\fR
ru: \f[B]Пустые строки:\f[R] Игнорируются и служат для визуального разделения\fR

source: Filters and Conditions
ru: Фильтры и условия

source: Single Filters
ru: Одиночные фильтры

source: \f[B]+ (Positive):\f[R] The condition is true if the variable value \f[B]matches\fR
ru: \f[B]+ (Положительный):\f[R] Условие истинно, если значение переменной \f[B]соответствует\fR

source: Format: \f[B]+=\fR
ru: Формат: \f[B]+=\fR

source: Example:
ru: Пример:

source: \f[B]- (Negative):\f[R] The condition is true if the variable value \f[B]does not match\fR
ru: \f[B]- (Отрицательный):\f[R] Условие истинно, если значение переменной \f[B]не соответствует\fR

source: Format: \f[B]-=\fR
ru: Формат: \f[B]-=\fR

source: Group Filters
ru: Групповые фильтры

source: \f[B]+{a|b} (OR for inclusion):\f[R] True if \f[B]at least one\f[R] of the conditions in the group is true\fR
ru: \f[B]+{a|b} (ИЛИ для включения):\f[R] Истинно, если \f[B]хотя бы одно\fR из условий в группе истинно\fR

source: \f[B]+{a&b} (AND for inclusion):\f[R] True only if \f[B]all\f[R] conditions in the group are true\fR
ru: \f[B]+{a&b} (И для включения):\f[R] Истинно только тогда, когда \f[B]все\f[R] условия в группе истинны\fR

source: \f[B]-{a|b} (OR for exclusion):\f[R] The package is excluded if \f[B]at least one\f[R] of the conditions is true\fR
ru: \f[B]-{a|b} (ИЛИ для исключения):\f[R] Пакет исключается, если \f[B]хотя бы одно\f[R] из условий истинно\fR

source: \f[B]-{a&b} (AND for exclusion):\f[R] The package is excluded only if \f[B]all\f[R] conditions are true\fR
ru: \f[B]-{a&b} (И для исключения):\f[R] Пакет исключается только тогда, когда \f[B]все\f[R] условия истинны\fR

source: Logical Operators
ru: Логические операторы

source: \f[B]|| (OR / Fallback):\f[R] Try to install the left part. If it fails, try the right part\fR
ru: \f[B]|| (ИЛИ / Запасной вариант):\f[R] Попытаться установить левую часть. В случае неудачи попробовать правую часть\fR

source: \f[B]&& (AND / Conjunction):\f[R] All parts must successfully pass filter checks\fR
ru: \f[B]&& (И / Конъюнкция):\f[R] Все части должны успешно пройти проверку фильтров\fR

source: Special Modifiers
ru: Специальные модификаторы

source: \f[B]! (Mandatory Package):\f[R] If a package is marked with \f[B]!\f[R], but cannot be found in repositories, CondinAPT will abort execution with an error\fR
ru: \f[B]! (Обязательный пакет):\f[R] Если пакет помечен \f[B]!\f[R], но не найден в репозиториях, CondinAPT прервёт выполнение с ошибкой\fR

source: \f[B]\[at] (Release Specification):\f[R] Install a package from a specific Debian/Ubuntu release\fR
ru: \f[B]\[at] (Указание релиза):\f[R] Установка пакета из конкретного релиза Debian/Ubuntu\fR

source: Installation Queues
ru: Очереди установки

source: The \f[B]\[em]\f[R] separator on a separate line divides the list into groups (queues). Packages from one queue are installed together in a single apt call. Queues are executed strictly sequentially.\fR
ru: Разделитель \f[B]\[em]\f[R] на отдельной строке делит список на группы (очереди). Пакеты из одной очереди устанавливаются вместе за один вызов apt. Очереди выполняются строго последовательно.\fR

source: \f[C] # Queue 1: Base system systemd network-manager --- # Queue 2: Web server nginx php-fpm --- # Queue 3: Monitoring prometheus\fR
ru: \f[C] # Очередь 1: Базовая система systemd network-manager --- # Очередь 2: Веб-сервер nginx php-fpm --- # Очередь 3: Мониторинг prometheus\fR

source: Priority Queue
ru: Приоритетная очередь

source: Packages listed in the file specified by the \f[B]-P\f[R] flag (one package per line, no filters) form a special \[lq]Queue #1\[rq], which is executed first.\fR
ru: Пакеты, перечисленные в файле, указанном флагом \f[B]-P\f[R] (один пакет на строку, без фильтров), образуют специальную \[lq]Очередь #1\[rq], которая выполняется первой.\fR

source: Any package from the priority list is automatically removed from all regular queues. This ensures it will be installed unconditionally.
ru: Любой пакет из списка приоритетов автоматически удаляется из всех обычных очередей. Это гарантирует его безусловную установку.

source: Quick Start
ru: Быстрый старт

source: Create the configuration file \f[B]config.conf\f[R]:\fR
ru: Создайте файл конфигурации \f[B]config.conf\f[R]:\fR

source: Create the package list \f[B]packages.list\f[R]:\fR
ru: Создайте список пакетов \f[B]packages.list\f[R]:\fR

source: \f[C] # Base packages - always installed vim curl\fR
ru: \f[C] # Базовые пакеты - всегда устанавливаются vim curl\fR

source: \f[C]# Packages only for servers nginx +SYSTEM_TYPE=server mysql-server +SYSTEM_TYPE=server\fR
ru: \f[C]# Пакеты только для серверов nginx +SYSTEM_TYPE=server mysql-server +SYSTEM_TYPE=server\fR

source: \f[C]# Exclude packages for production environment debug-tools -ENVIRONMENT=production\fR
ru: \f[C]# Исключить пакеты для production-среды debug-tools -ENVIRONMENT=production\fR

source: Run the installation:
ru: Запустите установку:

source: Or test in simulation mode:
ru: Или протестируйте в режиме симуляции:

source: Multimedia Server
ru: Мультимедийный сервер

source: \f[C] # Basic multimedia codecs - always gstreamer1.0-plugins-base gstreamer1.0-plugins-good\fR
ru: \f[C] # Базовые мультимедийные кодеки - всегда gstreamer1.0-plugins-base gstreamer1.0-plugins-good\fR

source: \f[C]# Additional codecs - not for minimal installation gstreamer1.0-plugins-bad -st=minimal gstreamer1.0-plugins-ugly -st=minimal\fR
ru: \f[C]# Дополнительные кодеки - не для минимальной установки gstreamer1.0-plugins-bad -st=minimal gstreamer1.0-plugins-ugly -st=minimal\fR

source: \f[C]# Professional tools - only for full configuration ffmpeg +st=media-server vlc +st=media-server --- # Distribution-specific packages from backports ffmpeg \[at]bookworm-backports +d=bookworm\fR
ru: \f[C]# Профессиональные инструменты - только для полной конфигурации ffmpeg +st=media-server vlc +st=media-server --- # Пакеты для конкретного дистрибутива из backports ffmpeg \[at]bookworm-backports +d=bookworm\fR

source: Web Server with Various Configurations
ru: Веб-сервер с различными конфигурациями

source: \f[C] # Basic web server components nginx openssl\fR
ru: \f[C] # Базовые компоненты веб-сервера nginx openssl\fR

source: \f[C]# Database - only for full installations mysql-server +st=full-server -{env=minimal} postgresql +st=database-server\fR
ru: \f[C]# База данных - только для полных установок mysql-server +st=full-server -{env=minimal} postgresql +st=database-server\fR

source: \f[C]# PHP - for web servers php-fpm +feat=php php-mysql +{feat=php&st=full-server}\fR
ru: \f[C]# PHP - для веб-серверов php-fpm +feat=php php-mysql +{feat=php&st=full-server}\fR

source: \f[C]# Monitoring - not for development prometheus-node-exporter -env=development\fR
ru: \f[C]# Мониторинг - не для разработки prometheus-node-exporter -env=development\fR

source: OPERATING MODES
ru: РЕЖИМЫ РАБОТЫ

source: Simulation Mode
ru: Режим симуляции

source: Allows you to see which packages will be installed without actually installing them:
ru: Позволяет увидеть, какие пакеты будут установлены, без фактической их установки:

source: In simulation mode, the script exits with exit code 1.
ru: В режиме симуляции скрипт завершает работу с кодом выхода 1.

source: Check Mode
ru: Режим проверки

source: Checks which packages from the list are already installed on the system:
ru: Проверяет, какие пакеты из списка уже установлены в системе:

source: Shows errors for uninstalled packages and returns exit code 1 if there are uninstalled packages.
ru: Показывает ошибки для неустановленных пакетов и возвращает код выхода 1, если есть неустановленные пакеты.

source: Debugging Modes
ru: Режимы отладки

source: \f[B]Verbose Output (-v):\fR
ru: \f[B]Подробный вывод (-v):\fR

source: Shows detailed information about filter checks and displays results for each package.
ru: Показывает подробную информацию о проверках фильтров и отображает результаты для каждого пакета.

source: \f[B]Very Verbose Output (-vv):\fR
ru: \f[B]Очень подробный вывод (-vv):\fR

source: Maximum process detail, shows all intermediate steps.
ru: Максимальная детализация процесса, показывает все промежуточные шаги.

source: \f[B]Command Tracing (-x):\fR
ru: \f[B]Трассировка команд (-x):\fR

source: Enables \f[B]set -x\f[R] for script debugging, shows each command being executed.\fR
ru: Включает \f[B]set -x\f[R] для отладки скрипта, показывает каждую выполняемую команду.\fR

source: ERROR HANDLING
ru: ОБРАБОТКА ОШИБОК

source: Mandatory Packages
ru: Обязательные пакеты

source: If a package is marked as mandatory (\f[B]!\f[R]) but not found in repositories, CondinAPT:\fR
ru: Если пакет помечен как обязательный (\f[B]!\f[R]), но не найден в репозиториях, CondinAPT:\fR

source: Outputs an error message
ru: Выводит сообщение об ошибке

source: Aborts execution (unless in simulation mode)
ru: Прерывает выполнение (если не в режиме симуляции)

source: Returns exit code 1
ru: Возвращает код выхода 1

source: Handling Unavailable Versions
ru: Обработка недоступных версий

source: \f[B]Loose Versions (=):\fR
ru: \f[B]Нестрогие версии (=):\fR

source: If the exact version is unavailable, any available version is installed with a warning.
ru: Если точная версия недоступна, устанавливается любая доступная версия с предупреждением.

source: \f[B]Strict Versions (==):\fR
ru: \f[B]Строгие версии (==):\fR

source: If the exact version is unavailable, the package is skipped. If the package is mandatory (\f[B]!\f[R]), execution aborts.\fR
ru: Если точная версия недоступна, пакет пропускается. Если пакет является обязательным (\f[B]!\f[R]), выполнение прерывается.\fR

source: Version Holding
ru: Удержание версии

source: CondinAPT automatically applies \f[B]apt-mark hold\f[R] when the exactly requested version was installed, preventing automatic updates.\fR
ru: CondinAPT автоматически применяет \f[B]apt-mark hold\f[R] при установке точно запрошенной версии, предотвращая автоматические обновления.\fR

source: FILES
ru: ФАЙЛЫ

source: Default configuration file
ru: Файл конфигурации по умолчанию

source: Default filter mapping file
ru: Файл сопоставления фильтров по умолчанию
