Repository: 1compk/minios-skyline
Catalog: po/*.po
Languages: de

source: This script builds bootable MiniOS ISO image.
de: Dieses Skript erstellt ein bootfähiges MiniOS ISO-Image.

source: Run the build from start to finish.
de: Führe den Build von Anfang bis Ende aus.

source: Start the build by building the base environment and finish by installing the entire system in chroot.
de: Starte den Build mit dem Erstellen der Basisumgebung und beende ihn mit der Installation des gesamten Systems in chroot.

source: Start the build from the beginning and finish by installing the entire system in chroot.
de: Starte den Build von Anfang an und beende ihn mit der Installation des gesamten Systems in chroot.

source: Start the build by building the base environment and run to completion.
de: Starte den Build mit dem Erstellen der Basisumgebung und führe ihn bis zum Abschluss aus.

source: Build only ISO image from previously prepared data.
de: Erstelle nur das ISO-Image aus zuvor vorbereiteten Daten.

source: Supported commands:
de: Unterstützte Befehle:

source: Usage:
de: Benutzung:

source: Run from start_cmd to end_cmd
de: Ausführung von start_cmd bis end_cmd

source: If start_cmd is omitted, start from the first command
de: Wenn start_cmd weggelassen wird, beginne mit dem ersten Befehl

source: If end_cmd is omitted, end with the last command
de: Wenn end_cmd weggelassen wird, beende mit dem letzten Befehl

source: Enter a single cmd to run the specific command
de: Gib einen einzelnen Befehl cmd ein, um den spezifischen Befehl auszuführen

source: Enter '-' as the only argument to run all commands\n
de: Gib '-' als einziges Argument ein, um alle Befehle auszuführen\n

source: Examples:
de: Beispiele:

source: Creates a system image with the specified parameters.
de: Erstellt ein Systemabbild mit den angegebenen Parametern.

source: Options:
de: Optionen:

source: Config Options:
de: Konfigurationsoptionen:

source: Specify the configuration file path. All other options are ignored.
de: Geben Sie den Pfad zur Konfigurationsdatei an. Alle anderen Optionen werden ignoriert.

source: Generate the configuration file only and do not start the build process.
de: Generieren Sie nur die Konfigurationsdatei und starten Sie den Build-Prozess nicht.

source: Build Options:
de: Build-Optionen:

source: Specify the build directory.
de: Geben Sie das Build-Verzeichnis an.

source: System Options:
de: Systemoptionen:

source: Specify the distribution name (e.g., 'bookworm'). REQUIRED
de: Geben Sie den Distributionsnamen an (z. B. 'bookworm'). ERFORDERLICH

source: Specify the architecture (e.g., 'amd64'). REQUIRED
de: Geben Sie die Architektur an (z. B. 'amd64'). ERFORDERLICH

source: Specify the desktop environment (e.g., 'xfce'). REQUIRED
de: Geben Sie die Desktop-Umgebung an (z. B. 'xfce'). ERFORDERLICH

source: Specify the package variant (e.g., 'standard'). REQUIRED
de: Geben Sie die Paketvariante an (z. B. 'standard'). ERFORDERLICH

source: Specify the compression type (e.g., 'zstd').
de: Geben Sie den Komprimierungstyp an (z. B. 'zstd').

source: Kernel Options:
de: Kernel-Optionen:

source: Specify the kernel type (e.g., 'default').
de: Geben Sie den Kernel-Typ an (z. B. 'default').

source: Enable the use of the Linux kernel from backports.
de: Aktivieren Sie die Verwendung des Linux-Kernels aus Backports.

source: Enable AUFS support in the kernel.
de: Aktivieren Sie die AUFS-Unterstützung im Kernel.

source: Enable compilation of additional drivers during kernel installation.
de: Aktivieren Sie die Kompilierung zusätzlicher Treiber während der Kernel-Installation.

source: Locale and Timezone Options:
de: Locale- und Zeitzonenoptionen:

source: Specify the system locale (e.g., 'en_US').
de: Geben Sie die Systemlocale an (z. B. 'en_US').

source: Enable multilingual support.
de: Aktivieren Sie die mehrsprachige Unterstützung.

source: Keep all available locales.
de: Behalten Sie alle verfügbaren Locales bei.

source: Specify the timezone (e.g., 'Etc/UTC').
de: Geben Sie die Zeitzone an (z. B. 'Etc/UTC').

source: Default Settings:
de: Standardeinstellungen:

source: Kernel Settings:
de: Kernel-Einstellungen:

source: Locale & Timezone Settings:
de: Locale- & Zeitzoneneinstellungen:

source: 1. Create a MiniOS Standard system image (default settings):
de: 1. Erstellen Sie ein MiniOS Standard-Systemabbild (Standardeinstellungen):

source: 2. Create a MiniOS Toolbox system image (default settings):
de: 2. Erstellen Sie ein MiniOS Toolbox-Systemabbild (Standardeinstellungen):

source: 3. Create a system image with the 'bookworm' distribution, 'amd64' architecture, 'toolbox' package variant, and Russian locale:
de: 3. Erstellen Sie ein Systemabbild mit der Distribution 'bookworm', der Architektur 'amd64', der Paketvariante 'toolbox' und der russischen Locale:

source: 3. Create a system image with the 'bookworm' distribution, 'amd64' architecture, 'standard' package variant and 'lxqt' desktop environment:
de: 3. Erstellen Sie ein Systemabbild mit der Distribution 'bookworm', der Architektur 'amd64', der Paketvariante 'standard' und der Desktop-Umgebung 'lxqt':

source: 4. Create a system image with 'buster' distribution, 'i386' architecture, and 'xfce' desktop environment:
de: 4. Erstellen Sie ein Systemabbild mit der Distribution 'buster', der Architektur 'i386' und der Desktop-Umgebung 'xfce':

source: 5. Create a system image with the 'bookworm' distribution, 'amd64' architecture, and 'xfce' desktop environment and with kernel from backports:
de: 5. Erstellen Sie ein Systemabbild mit der Distribution 'bookworm', der Architektur 'amd64', der Desktop-Umgebung 'xfce' und dem Kernel aus Backports:

source: 6. Create a system image with the 'jammy' distribution and 'standard' package variant:
de: 6. Erstellen Sie ein Systemabbild mit der Distribution 'jammy' und der Paketvariante 'standard':

source: 7. Create a system image with 'trixie' distribution, 'amd64' architecture, and 'xfce' desktop environment with multilingual support enabled:
de: 7. Erstellen Sie ein Systemabbild mit der Distribution 'trixie', der Architektur 'amd64', der Desktop-Umgebung 'xfce' und aktivierter mehrsprachiger Unterstützung:

source: has many more options available. Please refer to the above options list for more details.
de: bietet viele weitere Optionen. Weitere Informationen finden Sie in der obigen Optionsliste.

source: 4. Create a system image with the 'bookworm' distribution, 'amd64' architecture, 'standard' package variant and 'lxqt' desktop environment:
de: 4. Erstellen Sie ein Systemabbild mit der Distribution 'bookworm', der Architektur 'amd64', der Paketvariante 'standard' und der Desktop-Umgebung 'lxqt':

source: 5. Create a system image with 'buster' distribution, 'i386' architecture, and 'xfce' desktop environment:
de: 5. Erstellen Sie ein Systemabbild mit der Distribution 'buster', der Architektur 'i386' und der Desktop-Umgebung 'xfce':

source: 6. Create a system image with the 'bookworm' distribution, 'amd64' architecture, and 'xfce' desktop environment and with kernel from backports:
de: 6. Erstellen Sie ein Systemabbild mit der Distribution 'bookworm', der Architektur 'amd64', der Desktop-Umgebung 'xfce' und dem Kernel aus Backports:

source: 7. Create a system image with the 'jammy' distribution and 'standard' package variant:
de: 7. Erstellen Sie ein Systemabbild mit der Distribution 'jammy' und der Paketvariante 'standard':

source: 8. Create a system image with 'trixie' distribution, 'amd64' architecture, and 'xfce' desktop environment with multilingual support enabled:
de: 8. Erstellen Sie ein Systemabbild mit der Distribution 'trixie', der Architektur 'amd64', der Desktop-Umgebung 'xfce' und aktivierter mehrsprachiger Unterstützung:

source: Specify the kernel flavour (e.g., 'none').
de: Geben Sie die Kernel-Variante an (z. B. 'none').

source: Boot Menu Options:
de: Bootmenü-Optionen:

source: Specify the boot menu language ('multilang' for language selection or specific language code like 'ru_RU').
de: Geben Sie die Sprache des Bootmenüs an ('multilang' für Sprachauswahl oder spezifischen Sprachcode wie 'ru_RU').

source: Boot Menu Settings:
de: Bootmenü-Einstellungen:

source: 8. Create a system image with Russian boot menu language:
de: 8. Erstellen Sie ein Systemabbild mit russischer Bootmenü-Sprache:
