Repository: 1compk/minios-skyline
Catalog: linux-live/bootfiles/boot/grub/po/*.po
Languages: de_de, id_id, pt_pt, ru_ru

source: Resume previous session
de_de: Vorherige Sitzung fortsetzen
id_id: Lanjutkan sesi sebelumnya
pt_pt: Retomar sessão anterior
ru_ru: Возобновить предыдущую сессию

source: Start a new session
de_de: Neue Sitzung beginnen
id_id: Mulai sesi baru
pt_pt: Iniciar nova sessão
ru_ru: Начать новую сессию

source: Choose session during startup
de_de: Sitzung beim Start wählen
id_id: Pilih sesi saat startup
pt_pt: Escolher sessão ao iniciar
ru_ru: Выбрать сессию при запуске

source: Fresh start
de_de: Neustart
id_id: Mulai segar
pt_pt: Início limpo
ru_ru: Чистый старт

source: Copy to RAM
de_de: In RAM kopieren
id_id: Salin ke RAM
pt_pt: Copiar para RAM
ru_ru: Скопировать в RAM

source: Loading kernel and ramdisk...
de_de: Kernel und Ramdisk werden geladen...
id_id: Memuat kernel dan ramdisk...
pt_pt: A carregar kernel e ramdisk...
ru_ru: Загрузка ядра и ramdisk...

source: Back to language selection
de_de: Zurück zur Sprachauswahl
id_id: Kembali ke pilihan bahasa
pt_pt: Voltar à seleção de idioma
ru_ru: Назад к выбору языка

source: Press Esc for options, automatic boot in # second{,s} ...
de_de: Drücken Sie Esc für Optionen, automatischer Start in # Sekunde{,n} ...
id_id: Tekan Esc untuk opsi, boot otomatis dalam # detik{,s} ...
pt_pt: Prima Esc para opções, arranque automático em # segundo{,s} ...
ru_ru: Нажмите Esc для параметров, автозагрузка через # секунд{у,ы} ...

source: [F1] help
de_de: [F1] Hilfe
id_id: [F1] bantuan
pt_pt: [F1] ajuda
ru_ru: [F1] помощь

source: [Tab] cmdline >
de_de: [Tab] Befehlszeile >
id_id: [Tab] baris perintah >
pt_pt: [Tab] linha de comandos >
ru_ru: [Tab] команды >

source: Choose Language
de_de: Sprache wählen
id_id: Pilih Bahasa
pt_pt: Escolher idioma
ru_ru: Выберите язык
